===============================================================================
Paragraph: simple
===============================================================================
aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str)))

===============================================================================
Paragraph: multiple
===============================================================================
aaa

aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str))
  (emptyline)
  (paragraph
    (str)))

===============================================================================
Paragraph: indentation
===============================================================================
  aaa

aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str))
  (emptyline)
  (paragraph
    (str)))

===============================================================================
Paragraph: continuation
===============================================================================
aaa
aaa

aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str)
    (softbreak)
    (str))
  (emptyline)
  (paragraph
    (str)))

===============================================================================
Paragraph: paragraph with list marker
===============================================================================
aaa - aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str)))

===============================================================================
List: simple
===============================================================================
- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: list and paragraph
===============================================================================
- a

a
a

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline)))
  (paragraph
    (str)
    (softbreak)
    (str)))

===============================================================================
List: compact multiple listitems
===============================================================================
- aaa
- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str)))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: loose multiple listitems
===============================================================================
- aaa

- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: multiple paragraphs in list
===============================================================================
- aaa

  bb

- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline)
      (paragraph
        (str))
      (emptyline))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: nested list
===============================================================================
- aaa

  - aaa
  - bbb

- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline)
      (list
        (listitem
          (listitem_marker)
          (paragraph
            (str)))
        (listitem
          (listitem_marker)
          (paragraph
            (str))
          (emptyline))))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
Emphasis: simple
===============================================================================
{*aaa}

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (str))))

===============================================================================
Emphasis: escaped
===============================================================================
\{*aaa\}

-------------------------------------------------------------------------------

(document
  (paragraph
      (str)))

===============================================================================
Heading: simple
===============================================================================
# aaa

-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)
    (str)))

===============================================================================
Heading: multiline
===============================================================================
# aaa
aaa

-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)
    (str)
    (softbreak)
    (str)))

===============================================================================
Quote: multiline
===============================================================================
> a

a

-------------------------------------------------------------------------------

(document
  (quote
    (quote_marker)
    (paragraph
      (str))
    (emptyline))
  (paragraph
    (str)))

===============================================================================
Quote: nested
===============================================================================
> a

  > a

a

-------------------------------------------------------------------------------

(document
  (quote
    (quote_marker)
    (paragraph
      (str))
    (emptyline)
    (quote
      (quote_marker)
      (paragraph
        (str))
      (emptyline)))
  (paragraph
    (str)))

===============================================================================
Quote: muiltiline
===============================================================================
> a

  b

-------------------------------------------------------------------------------

(document
  (quote
    (quote_marker)
    (paragraph
      (str))
    (emptyline)
    (paragraph
      (str))))
