===============================================================================
Paragraph: simple
===============================================================================
aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str)))

===============================================================================
Paragraph: multiple
===============================================================================
aaa

aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str))
  (emptyline)
  (paragraph
    (str)))

===============================================================================
Paragraph: indentation
===============================================================================
  aaa

aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str))
  (emptyline)
  (paragraph
    (str)))

===============================================================================
Paragraph: continuation
===============================================================================
aaa
aaa

aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str)
    (softbreak)
    (str))
  (emptyline)
  (paragraph
    (str)))

===============================================================================
Paragraph: paragraph with list marker
===============================================================================
aaa - aaa

-------------------------------------------------------------------------------

(document
  (paragraph
    (str)))

===============================================================================
List: simple
===============================================================================
- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: list and paragraph
===============================================================================
- a

a
a

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline)))
  (paragraph
    (str)
    (softbreak)
    (str)))

===============================================================================
List: list with a following paragraph
===============================================================================
- a
a
a

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))))
  (paragraph
    (str)
    (softbreak)
    (str)))

===============================================================================
List: compact multiple listitems
===============================================================================
- aaa
- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str)))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: loose multiple listitems
===============================================================================
- aaa

- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: multiple paragraphs in list
===============================================================================
- aaa

  bb

- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline)
      (paragraph
        (str))
      (emptyline))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: nested list
===============================================================================
- aaa

  - aaa
  - bbb

- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str))
      (emptyline)
      (list
        (listitem
          (listitem_marker)
          (paragraph
            (str)))
        (listitem
          (listitem_marker)
          (paragraph
            (str))
          (emptyline))))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
List: multiline paragraph in list
===============================================================================
- aaa
  bb
- aaa

-------------------------------------------------------------------------------

(document
  (list
    (listitem
      (listitem_marker)
      (paragraph
        (str)
        (softbreak)
        (str)))
    (listitem
      (listitem_marker)
      (paragraph
        (str)))))

===============================================================================
Emphasis: simple
===============================================================================
_{aaa}_

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (str))))

===============================================================================
Emphasis: escaped
===============================================================================
_\{aaa\}_

-------------------------------------------------------------------------------

(document
  (paragraph
      (str)))

===============================================================================
Emphasis: following a string
===============================================================================
aaa_{aaa}_

-------------------------------------------------------------------------------

(document
  (paragraph
      (str)
      (emphasis
        (str))))

===============================================================================
Heading: simple
===============================================================================
# aaa

-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)
    (str)))

===============================================================================
Heading: multiline
===============================================================================
# aaa
aaa

-------------------------------------------------------------------------------

(document
  (heading
    (heading_marker)
    (str)
    (softbreak)
    (str)))

===============================================================================
Quote: multiline
===============================================================================
> a

a

-------------------------------------------------------------------------------

(document
  (quote
    (quote_marker)
    (paragraph
      (str))
    (emptyline))
  (paragraph
    (str)))

===============================================================================
Quote: nested
===============================================================================
> a

  > a

a

-------------------------------------------------------------------------------

(document
  (quote
    (quote_marker)
    (paragraph
      (str))
    (emptyline)
    (quote
      (quote_marker)
      (paragraph
        (str))
      (emptyline)))
  (paragraph
    (str)))

===============================================================================
Quote: multiline
===============================================================================
> a

  b

-------------------------------------------------------------------------------

(document
  (quote
    (quote_marker)
    (paragraph
      (str))
    (emptyline)
    (paragraph
      (str))))

===============================================================================
Inline Verbatim: simple
===============================================================================
`{aa}`

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_verbatim
      (inline_verbatim_start)
      (inline_verbatim_content)
      (inline_verbatim_end))))

===============================================================================
Inline Verbatim: escaped
===============================================================================
`{a}}`

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_verbatim
      (inline_verbatim_start)
      (inline_verbatim_content)
      (inline_verbatim_end))))

===============================================================================
Inline Verbatim: multiline
===============================================================================
`{a
}}`

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_verbatim
      (inline_verbatim_start)
      (inline_verbatim_content)
      (inline_verbatim_end))))
